# Решу ЕГЭ 8660, №10.
# IP-адрес узла: 199.145.130.81, маска: 255.255.128.0.
# Адрес сети - поразрядная конъюнкция IP-адреса и маски (по каждому из четырёх чисел).
# Запишите адрес сети буквами: A=0, B=81, C=113, D=128, E=130, F=145, G=199, H=225.
def network(ip: list[int], mask: list[int]) -> list[int]:
    pass




print(network([192, 168, 1, 10], [255, 255, 255, 0]), [192, 168, 1, 0])
print(network([199, 145, 130, 81], [255, 255, 128, 0]), [199, 145, 128, 0])
# ответ (буквы по таблице): GFDA


from ipaddress import *
net = ip_network('199.145.130.81/255.255.128.0', 0)
print(net)