# Решу ЕГЭ 48402, №14.
# Выражение 3xDA (14-ричная) + 5xA6 (12-ричная), x - неизвестная цифра от 0 до 9.
# Найдите наименьшее x, при котором выражение кратно 81, и запишите частное от деления выражения на 81.
# Значение выражения при цифре x.
def value(x: int) -> int:
    return int(f'3{x}DA', 14) + int(f'5{x}A6', 12)


# Частное для наименьшего подходящего x.
def answer():
    for x in range(10):
        if value(x) % 81 == 0:
            return value(x) / 81




print(value(0), 17190)
print(answer(), 250)
