# Решу ЕГЭ 59680 (ЕГЭ-2023, основная волна, №2).
# Миша заполнял таблицу истинности функции F = (x ∧ ¬y) ∨ (x ≡ z) ∨ w,
# но успел заполнить лишь фрагмент из трёх различных строк, не указав, какому столбцу соответствует каждая переменная.
# Фрагмент таблицы (пусто - не заполнено):
#  ? ? ? ? | F
#      0 1 | 0
#  1 0   1 | 0
#  1 1 0   | 0
# Какому столбцу соответствует каждая из переменных w, x, y, z? Ответ: буквы в порядке столбцов.
def f(x: int, y: int, z: int, w: int) -> bool:
    return (x and not y) or (x == z) or w


# Все строки таблицы, где F = 0, в порядке x y z w.
def false_rows() -> list[tuple[int, int, int, int]]:
    pass




print(false_rows(), [(0, 0, 1, 0), (0, 1, 1, 0), (1, 1, 0, 0)])
# ответ (сопоставить руками): yxwz
