# Решу ЕГЭ 15638 (досрок ЕГЭ-2018).
# Исполнитель Калькулятор. Команды: 1. Прибавить 1; 2. Умножить на 2.
# Сколько существует программ, для которых при исходном числе 1 результатом является число 21,
# при этом траектория вычислений содержит число 10 и не содержит число 17?
# Сколько программ переводят a в b, не проходя через число avoid (0 - запрета нет).
def count(a: int, b: int, avoid: int = 0) -> int:
    pass

# Ответ задачи: через 10, без 17.
def answer() -> int:
    pass




print(count(2, 8), 5)
print(count(2, 8, 6), 2)
print(answer(), 14)
