# Задание ФИПИ, группа 9914FB.
# Куча из s камней, s >= 17. Ход: убрать 3 камня, убрать 8 камней или уменьшить кучу в 3 раза (с округлением вниз).
# Игра кончается, когда камней не более 16. Выиграл тот, кто сделал последний ход. Первым ходит Петя.
FINISH = 16


def moves(s: int) -> list[int]:
    pass


# Тот, кто ходит при s камнях, выиграет не больше чем за k своих ходов при любой игре соперника.
def can_win(s: int, k: int) -> bool:
    pass


# Тот, кто ходит при s камнях, проиграет: соперник выиграет не больше чем за k своих ходов.
def must_lose(s: int, k: int) -> bool:
    pass


# №19: минимальное s, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня выигрывает первым ходом.
def q19() -> int:
    pass


# №20: два наименьших s, при которых Петя не может выиграть за один ход, но выигрывает своим вторым ходом.
def q20() -> list[int]:
    pass


# №21: минимальное s, при котором Ваня выигрывает первым или вторым ходом, но гарантированно первым не может.
def q21() -> int:
    pass




print(q19(), 51)
print(q20(), [54, 55])
print(q21(), 57)
