# Задание ФИПИ 033FB4 (демо ЕГЭ-2027, №2).
# Миша заполнял таблицу истинности функции F = ((x ≡ ¬y) → ¬(w → x)) ∨ ¬z,
# но успел заполнить лишь фрагмент из трёх различных строк, не указав, какому столбцу соответствует каждая переменная.
# Фрагмент таблицы (пусто - не заполнено):
#  ? ? ? ? | F
#    0 1 0 | 0
#  0     0 | 0
#    1 1   | 0
# Какому столбцу соответствует каждая из переменных w, x, y, z? Ответ: буквы в порядке столбцов.
def f(w: int, x: int, y: int, z: int) -> bool:
    return ((x == (not y)) <= (not (w <= x))) or (not z)


# Все строки таблицы, где F = 0, в порядке w x y z.
def false_rows() -> list[tuple[int, int, int, int]]:
    res = []
    for w in range(2):
        for x in range(2):
            for y in range(2):
                for z in range(2):
                    if not f(w, x, y, z):
                        res.append((w, x, y, z))
    return res



# print(false_rows(), [(0, 0, 1, 1), (0, 1, 0, 1), (1, 1, 0, 1)])
print('(w, x, y, z)', *false_rows(), sep='\n')
# ответ (сопоставить руками): yxzw


B = [70, 71, 72, ..., 89, 90]

x in B