from collections import deque


# LeetCode 913. Cat and Mouse.
# Неориентированный граф: graph[v] - соседи вершины v. Мышь стоит в 1, кот в 2, нора - 0.
# Ходят по очереди, первой ходит мышь; стоять на месте нельзя, кот не может зайти в 0.
# Мышь в норе - победа мыши, кот на мыши - победа кота, бесконечная игра - ничья.
# Вернуть 1, если выигрывает мышь, 2 - если кот, 0 - ничья.
def cat_mouse_game(graph: list[list[int]]) -> int:
    pass




print(cat_mouse_game([[2, 5], [3], [0, 4, 5], [1, 4, 5], [2, 3], [0, 2, 3]]), 0)
print(cat_mouse_game([[1, 3], [0], [3], [0, 2]]), 1)
print(cat_mouse_game([[2, 3], [2], [0, 1], [0]]), 2)
print(cat_mouse_game([[1, 2], [0, 2], [0, 1]]), 1)
print(cat_mouse_game([[2, 3], [3, 4], [0, 4], [0, 1], [1, 2]]), 1)
